Catalogs/АР_ЗданияИЭтажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ЗданияИЭтажи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеНаПлане</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ЗданияИЭтажи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция РассчитатьПолезнуюПлощадь()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(АР_ОбъектыАренды.ЗначениеХарактеристики) КАК Площадь
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	|ГДЕ
	|	АР_ОбъектыАренды.ЗданиеИЭтаж = &Ссылка";
	
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ПолезнаяПлощадь = Выборка.Площадь;
	КонецЕсли;

КонецФункции // РассчитатьПолезнуюПлощадь()

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьФлагФормироватьНаименованиеПолноеАвтоматически(НаименованиеПолное,Наименование)
   
   Возврат (ПустаяСтрока(НаименованиеПолное) ИЛИ НаименованиеПолное = Наименование);
   
КонецФункции // УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПолезнуюПлощадь();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ФормироватьНаименованиеПолноеАвтоматически Тогда
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасположениеНаПланеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		
		Если Не ЗначениеЗаполнено(ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Объект.РасположениеНаПлане, "ФайлШаблона")) Тогда
			Возврат;
		КонецЕсли;
		Файл = Новый Файл(ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Объект.РасположениеНаПлане, "ФайлШаблона"));
		Если Не Файл.Существует() Тогда
			Возврат; 
		КонецЕсли;
		
		Excel = Новый COMОбъект("Excel.Application");
		Попытка 
			Шаблон = Excel.Workbooks.Open(ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Объект.РасположениеНаПлане, "ФайлШаблона"),, Истина);
		Исключение
			Возврат;
		КонецПопытки;
		
		Шаблон.Sheets(СокрЛП(ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Объект.РасположениеНаПлане, "Лист"))).Select();
		Шаблон.Application.Run("ВсеПоУмолчанию");
		#Если ВебКлиент Тогда
			ПолноеИмяФайла = "";
		#Иначе
			ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
		#КонецЕсли
		Шаблон.SaveAs(ПолноеИмяФайла);
		Excel.Visible = 1;
		Шаблон = Неопределено;
	Исключение
		Шаблон = Неопределено;
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПолноеНаименованиеПриИзменении(Элемент)
	ФормироватьНаименованиеПолноеАвтоматически = УстановитьФлагФормироватьНаименованиеПолноеАвтоматически(Элементы.ПолноеНаименование,Элементы.Наименование);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
    ФормироватьНаименованиеПолноеАвтоматически = УстановитьФлагФормироватьНаименованиеПолноеАвтоматически(Объект.ПолноеНаименование,Объект.Наименование);
	
КонецПроцедуры
